app/views/photos/index.html.haml

SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 3]]
---
      = link_to "Likes", photo_likes_path(photo), class: 'likes-link'
      %span.likes_count= photo.likes.count

SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 3]]
---

      - if photo.comments.any?