app/views/photos/show.html.haml


- if @photo.comments.any?
---
SELECT  1 AS one FROM "comments" WHERE "comments"."photo_id" = $1 LIMIT 1  [["photo_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 4]]