app/controllers/comments_controller.rb

  def new
    @photo = Photo.find(params[:photo_id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @photo = Photo.find(params[:photo_id])
    @photo.comments.create(comment_params)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("thoughts", "user_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thoughts", "fwfwf"], ["user_id", 1], ["photo_id", 4], ["created_at", "2015-11-05 14:12:37.486296"], ["updated_at", "2015-11-05 14:12:37.486296"]]