app/controllers/likes_controller.rb

  def create
    @photo = Photo.find(params[:photo_id])
    @photo.create_like(current_user)
    render json: {new_like_count: @photo.likes.count}
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "likes" ("photo_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["photo_id", 1], ["user_id", 1], ["created_at", "2015-11-13 16:29:14.033173"], ["updated_at", "2015-11-13 16:29:14.033173"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."photo_id" = $1  [["photo_id", 4]]