app/controllers/photos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def new
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "photos" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Baby"], ["user_id", 1], ["created_at", "2015-11-07 19:05:39.059119"], ["updated_at", "2015-11-07 19:05:39.059119"]]
---
  def create
    @user = User.find(current_user.id)
    @photo = Photo.create(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @photo = Photo.find(params[:id])

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "photos" SET "title" = $1, "user_id" = $2, "updated_at" = $3 WHERE "photos"."id" = $4  [["title", "wefwfwefwffewf"], ["user_id", 1], ["updated_at", "2015-11-05 15:36:47.364025"], ["id", 6]]
---
  def update
    @photo = Photo.find(params[:id])
    @photo.update(photo_params)